OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx6.h
/*******************  Bit definition for I2C_SR2 register  ********************/
#define I2C_SR2_MSL_Pos                     (0U)
#define I2C_SR2_MSL_Msk                     (0x1UL << I2C_SR2_MSL_Pos)          /*!< 0x00000001 */
#define I2C_SR2_MSL                         I2C_SR2_MSL_Msk                     /*!< Master/Slave */

#define I2C_SR2_BUSY_Pos                    (1U)
#define I2C_SR2_BUSY_Msk                    (0x1UL << I2C_SR2_BUSY_Pos)         /*!< 0x00000002 */
#define I2C_SR2_BUSY                        I2C_SR2_BUSY_Msk                    /*!< Bus Busy */

#define I2C_SR2_TRA_Pos                     (2U)
#define I2C_SR2_TRA_Msk                     (0x1UL << I2C_SR2_TRA_Pos)          /*!< 0x00000004 */
#define I2C_SR2_TRA                         I2C_SR2_TRA_Msk                     /*!< Transmitter/Receiver */

#define I2C_SR2_GENCALL_Pos                 (4U)
#define I2C_SR2_GENCALL_Msk                 (0x1UL << I2C_SR2_GENCALL_Pos)      /*!< 0x00000010 */
#define I2C_SR2_GENCALL                     I2C_SR2_GENCALL_Msk                 /*!< General Call Address (Slave mode) */

/*******************  Bit definition for I2C_CCR register  ********************/
#define I2C_CCR_CCR_Pos                     (0U)
#define I2C_CCR_CCR_Msk                     (0xFFFUL << I2C_CCR_CCR_Pos)        /*!< 0x00000FFF */
#define I2C_CCR_CCR                         I2C_CCR_CCR_Msk                     /*!< Clock Control Register in Fast/Standard mode (Master mode) */

#define I2C_CCR_FP_Pos                      (13U)
#define I2C_CCR_FP_Msk                      (0x1UL << I2C_CCR_FP_Pos)           /*!< 0x00002000 */
#define I2C_CCR_FP                          I2C_CCR_FP_Msk                      /*!< I2C Master Mode Selection */

#define I2C_CCR_DUTY_Pos                    (14U)
#define I2C_CCR_DUTY_Msk                    (0x1UL << I2C_CCR_DUTY_Pos)         /*!< 0x00004000 */
#define I2C_CCR_DUTY                        I2C_CCR_DUTY_Msk                    /*!< Fast Mode Duty Cycle */

#define I2C_CCR_FS_Pos                      (15U)
#define I2C_CCR_FS_Msk                      (0x1UL << I2C_CCR_FS_Pos)           /*!< 0x00008000 */
#define I2C_CCR_FS                          I2C_CCR_FS_Msk                      /*!< I2C Master Mode Selection */

/******************  Bit definition for I2C_TRISE register  *******************/
#define I2C_TRISE_TRISE_Pos                 (0U)
#define I2C_TRISE_TRISE_Msk                 (0x7FUL << I2C_TRISE_TRISE_Pos)        /*!< 0x0000007F */
#define I2C_TRISE_TRISE                     I2C_TRISE_TRISE_Msk                    /*!< Maximum Rise Time in Fast/Standard mode (Master mode) */

#define I2C_TRISE_THOLDDATA_Pos              (7U)
#define I2C_TRISE_THOLDDATA_Msk              (0x1FUL << I2C_TRISE_THOLDDATA_Pos)     /*!< 0x00000F80 */
#define I2C_TRISE_THOLDDATA                  I2C_TRISE_THOLDDATA_Msk                 /*!< Maximum data hold Time in Fast/Standard mode (Master mode) */

#define I2C_TRISE_THOLDDATA_SEL_Pos         (12U)
#define I2C_TRISE_THOLDDATA_SEL_Msk         (0x1UL << I2C_TRISE_THOLDDATA_SEL_Pos) /*!< 0x00001000 */
#define I2C_TRISE_THOLDDATA_SEL             I2C_TRISE_THOLDDATA_SEL_Msk            /*!< Data hold time select */

/******************  Bit definition for I2C_WT register  *******************/
#define I2C_WT_DIV_Pos                      (0U)
#define I2C_WT_DIV_Msk                      (0x3UL << I2C_WT_DIV_Pos)              /*!< 0x00000003 */
#define I2C_WT_DIV                          I2C_WT_DIV_Msk                         /*!< Pclk divider         */
#define I2C_WT_DIV_0                        (0x01UL << I2C_WT_DIV_Pos)             /*!< 0x00000001 */
#define I2C_WT_DIV_1                        (0x02UL << I2C_WT_DIV_Pos)             /*!< 0x00000002 */

#define I2C_WT_CNT_Pos                      (2U)
#define I2C_WT_CNT_Msk                      (0x3UL << I2C_WT_CNT_Pos)              /*!< 0x0000000C */
#define I2C_WT_CNT                          I2C_WT_CNT_Msk                         /*!< The numbers of timeout counts  */
#define I2C_WT_CNT_0                        (0x01UL << I2C_WT_CNT_Pos)             /*!< 0x00000004 */
#define I2C_WT_CNT_1                        (0x02UL << I2C_WT_CNT_Pos)             /*!< 0x00000008 */

/******************************************************************************/
/*                                                                            */
/*                        Independent WATCHDOG (IWDG)                         */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for IWDG_KR register  ********************/
#define IWDG_KR_KEY_Pos      (0U)
#define IWDG_KR_KEY_Msk      (0xFFFFUL << IWDG_KR_KEY_Pos)                     /*!< 0x0000FFFF */
#define IWDG_KR_KEY          IWDG_KR_KEY_Msk                                   /*!< Key value (write only, read 0000h)  */

/*******************  Bit definition for IWDG_PR register  ********************/
#define IWDG_PR_PR_Pos       (0U)
#define IWDG_PR_PR_Msk       (0x7UL << IWDG_PR_PR_Pos)                         /*!< 0x00000007 */
#define IWDG_PR_PR           IWDG_PR_PR_Msk                                    /*!< PR[2:0] (Prescaler divider)         */
#define IWDG_PR_PR_0         (0x1UL << IWDG_PR_PR_Pos)                         /*!< 0x00000001 */
#define IWDG_PR_PR_1         (0x2UL << IWDG_PR_PR_Pos)                         /*!< 0x00000002 */
#define IWDG_PR_PR_2         (0x4UL << IWDG_PR_PR_Pos)                         /*!< 0x00000004 */

/*******************  Bit definition for IWDG_RLR register  *******************/
#define IWDG_RLR_RL_Pos      (0U)
#define IWDG_RLR_RL_Msk      (0xFFFUL << IWDG_RLR_RL_Pos)                      /*!< 0x00000FFF */
#define IWDG_RLR_RL          IWDG_RLR_RL_Msk                                   /*!< Watchdog counter reload value        */

/*******************  Bit definition for IWDG_SR register  ********************/
#define IWDG_SR_PVU_Pos      (0U)
#define IWDG_SR_PVU_Msk      (0x1UL << IWDG_SR_PVU_Pos)                        /*!< 0x00000001 */
#define IWDG_SR_PVU          IWDG_SR_PVU_Msk                                   /*!< Watchdog prescaler value update */

