OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx6.h
#define RCC_BDCR_LSECSSD_Pos             (6U)
#define RCC_BDCR_LSECSSD_Msk             (0x1UL << RCC_BDCR_LSECSSD_Pos)        /*!< 0x00000040 */
#define RCC_BDCR_LSECSSD                 RCC_BDCR_LSECSSD_Msk                   /*!< LSE CSS defeat */

#define RCC_BDCR_RTCSEL_Pos              (8U)
#define RCC_BDCR_RTCSEL_Msk              (0x3UL << RCC_BDCR_RTCSEL_Pos)         /*!< 0x00000300 */
#define RCC_BDCR_RTCSEL                  RCC_BDCR_RTCSEL_Msk                    /*!< RTC clock select */
#define RCC_BDCR_RTCSEL_0                (0x1UL << RCC_BDCR_RTCSEL_Pos)         /*!< 0x00000100 */
#define RCC_BDCR_RTCSEL_1                (0x2UL << RCC_BDCR_RTCSEL_Pos)         /*!< 0x00000200 */

#define RCC_BDCR_RTC_HSEDIV_SEL_Pos      (10U)
#define RCC_BDCR_RTC_HSEDIV_SEL_Msk      (0x3UL << RCC_BDCR_RTC_HSEDIV_SEL_Pos) /*!< 0x000000C0 */
#define RCC_BDCR_RTC_HSEDIV_SEL          RCC_BDCR_RTC_HSEDIV_SEL_Msk            /*!< RTC clock divider */
#define RCC_BDCR_RTC_HSEDIV_SEL_0        (0x1UL << RCC_BDCR_RTC_HSEDIV_SEL_Pos) /*!< 0x00000040 */
#define RCC_BDCR_RTC_HSEDIV_SEL_1        (0x2UL << RCC_BDCR_RTC_HSEDIV_SEL_Pos) /*!< 0x00000080 */

#define RCC_BDCR_RTCEN_Pos               (15U)
#define RCC_BDCR_RTCEN_Msk               (0x1UL << RCC_BDCR_RTCEN_Pos)          /*!< 0x00008000 */
#define RCC_BDCR_RTCEN                   RCC_BDCR_RTCEN_Msk                     /*!< RTC clock enable */

#define RCC_BDCR_BDRST_Pos               (16U)
#define RCC_BDCR_BDRST_Msk               (0x1UL << RCC_BDCR_BDRST_Pos)          /*!< 0x00010000 */
#define RCC_BDCR_BDRST                   RCC_BDCR_BDRST_Msk                     /*!< RTC reset */

#define RCC_BDCR_LSCSEL_Pos              (25U)
#define RCC_BDCR_LSCSEL_Msk              (0x1UL << RCC_BDCR_LSCSEL_Pos)         /*!< 0x02000000 */
#define RCC_BDCR_LSCSEL                  RCC_BDCR_LSCSEL_Msk                    /*!< LOW speed clock select */

/********************  Bit definition for RCC_CSR register  *******************/
#define RCC_CSR_LSION_Pos                (0U)
#define RCC_CSR_LSION_Msk                (0x1UL << RCC_CSR_LSION_Pos)           /*!< 0x00000001 */
#define RCC_CSR_LSION                    RCC_CSR_LSION_Msk                      /*!< LSI enbale */

#define RCC_CSR_LSIRDY_Pos               (1U)
#define RCC_CSR_LSIRDY_Msk               (0x1UL << RCC_CSR_LSIRDY_Pos)          /*!< 0x00000002 */
#define RCC_CSR_LSIRDY                   RCC_CSR_LSIRDY_Msk                     /*!< LSI ready flag */

#define RCC_CSR_NRST_FLTDIS_Pos          (8U)
#define RCC_CSR_NRST_FLTDIS_Msk          (0x1UL << RCC_CSR_NRST_FLTDIS_Pos)     /*!< 0x00000100 */
#define RCC_CSR_NRST_FLTDIS              RCC_CSR_NRST_FLTDIS_Msk                /*!< NRST filter diable */

#define RCC_CSR_BORRSTF_Pos              (9U)
#define RCC_CSR_BORRSTF_Msk              (0x1UL << RCC_CSR_BORRSTF_Pos)         /*!< 0x00000200 */
#define RCC_CSR_BORRSTF                  RCC_CSR_BORRSTF_Msk                    /*!< BOR reset flag */

#define RCC_CSR_RMVF_Pos                 (23U)
#define RCC_CSR_RMVF_Msk                 (0x1UL << RCC_CSR_RMVF_Pos)            /*!< 0x00800000 */
#define RCC_CSR_RMVF                     RCC_CSR_RMVF_Msk                       /*!< Remove reset flag */

#define RCC_CSR_OBLRSTF_Pos              (25U)
#define RCC_CSR_OBLRSTF_Msk              (0x1UL << RCC_CSR_OBLRSTF_Pos)         /*!< 0x02000000 */
#define RCC_CSR_OBLRSTF                  RCC_CSR_OBLRSTF_Msk                    /*!< Option byte reset flag */

#define RCC_CSR_PINRSTF_Pos              (26U)
#define RCC_CSR_PINRSTF_Msk              (0x1UL << RCC_CSR_PINRSTF_Pos)         /*!< 0x04000000 */
#define RCC_CSR_PINRSTF                  RCC_CSR_PINRSTF_Msk                    /*!< NRST pin reset flag */

#define RCC_CSR_PORRSTF_Pos              (27U)
#define RCC_CSR_PORRSTF_Msk              (0x1UL << RCC_CSR_PORRSTF_Pos)         /*!< 0x08000000 */
#define RCC_CSR_PORRSTF                  RCC_CSR_PORRSTF_Msk                    /*!< POR reset flag */

#define RCC_CSR_SFTRSTF_Pos              (28U)
#define RCC_CSR_SFTRSTF_Msk              (0x1UL << RCC_CSR_SFTRSTF_Pos)         /*!< 0x10000000 */
#define RCC_CSR_SFTRSTF                  RCC_CSR_SFTRSTF_Msk                    /*!< Soft reset flag */

#define RCC_CSR_IWDGRSTF_Pos             (29U)
#define RCC_CSR_IWDGRSTF_Msk             (0x1UL << RCC_CSR_IWDGRSTF_Pos)        /*!< 0x20000000 */
#define RCC_CSR_IWDGRSTF                 RCC_CSR_IWDGRSTF_Msk                   /*!< IWDG reset flag */

/******************************************************************************/
/*                                                                            */
/*                             Real-Time Clock (RTC)                          */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for RTC_CRH register  ********************/
#define RTC_CRH_SECIE_Pos                   (0U)
#define RTC_CRH_SECIE_Msk                   (0x1UL << RTC_CRH_SECIE_Pos)        /*!< 0x00000001 */
#define RTC_CRH_SECIE                       RTC_CRH_SECIE_Msk                   /*!< Second Interrupt Enable */

#define RTC_CRH_ALRIE_Pos                   (1U)
#define RTC_CRH_ALRIE_Msk                   (0x1UL << RTC_CRH_ALRIE_Pos)        /*!< 0x00000002 */
#define RTC_CRH_ALRIE                       RTC_CRH_ALRIE_Msk                   /*!< Alarm Interrupt Enable */

#define RTC_CRH_OWIE_Pos                    (2U)
#define RTC_CRH_OWIE_Msk                    (0x1UL << RTC_CRH_OWIE_Pos)         /*!< 0x00000004 */
#define RTC_CRH_OWIE                        RTC_CRH_OWIE_Msk                    /*!< Overflow Interrupt Enable */

#define RTC_CRH_TK_SECIE_Pos                (3U)
#define RTC_CRH_TK_SECIE_Msk                (0x1UL << RTC_CRH_TK_SECIE_Pos)     /*!< 0x00000008 */
#define RTC_CRH_TK_SECIE                    RTC_CRH_TK_SECIE_Msk                /*!< TK Second Interrupt Enable */

#define RTC_CRH_TK_ALRIE_Pos                (4U)
#define RTC_CRH_TK_ALRIE_Msk                (0x1UL << RTC_CRH_TK_ALRIE_Pos)     /*!< 0x00000010 */
#define RTC_CRH_TK_ALRIE                    RTC_CRH_TK_ALRIE_Msk                /*!< TK Alarm Interrupt Enable */

