OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx6.h
#define SYSCFG_PA_IORP_PA5_IORP_Pos               (10U)
#define SYSCFG_PA_IORP_PA5_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA5_IORP_Pos)         /*!< 0x00000C00 */
#define SYSCFG_PA_IORP_PA5_IORP                   SYSCFG_PA_IORP_PA5_IORP_Msk                    
#define SYSCFG_PA_IORP_PA5_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA5_IORP_Pos)         /*!< 0x00000400 */ 
#define SYSCFG_PA_IORP_PA5_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA5_IORP_Pos)         /*!< 0x00000800 */ 

#define SYSCFG_PA_IORP_PA6_IORP_Pos               (12U)
#define SYSCFG_PA_IORP_PA6_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA6_IORP_Pos)         /*!< 0x00003000 */
#define SYSCFG_PA_IORP_PA6_IORP                   SYSCFG_PA_IORP_PA6_IORP_Msk                    
#define SYSCFG_PA_IORP_PA6_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA6_IORP_Pos)         /*!< 0x00001000 */ 
#define SYSCFG_PA_IORP_PA6_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA6_IORP_Pos)         /*!< 0x00002000 */ 

#define SYSCFG_PA_IORP_PA7_IORP_Pos               (14U)
#define SYSCFG_PA_IORP_PA7_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA7_IORP_Pos)         /*!< 0x0000C000 */
#define SYSCFG_PA_IORP_PA7_IORP                   SYSCFG_PA_IORP_PA7_IORP_Msk                    
#define SYSCFG_PA_IORP_PA7_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA7_IORP_Pos)         /*!< 0x00004000 */ 
#define SYSCFG_PA_IORP_PA7_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA7_IORP_Pos)         /*!< 0x00008000 */ 

#define SYSCFG_PA_IORP_PA8_IORP_Pos               (16U)
#define SYSCFG_PA_IORP_PA8_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA8_IORP_Pos)         /*!< 0x00030000 */
#define SYSCFG_PA_IORP_PA8_IORP                   SYSCFG_PA_IORP_PA8_IORP_Msk                    
#define SYSCFG_PA_IORP_PA8_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA8_IORP_Pos)         /*!< 0x00010000 */ 
#define SYSCFG_PA_IORP_PA8_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA8_IORP_Pos)         /*!< 0x00020000 */ 

#define SYSCFG_PA_IORP_PA9_IORP_Pos               (18U)
#define SYSCFG_PA_IORP_PA9_IORP_Msk               (0x3UL << SYSCFG_PA_IORP_PA9_IORP_Pos)         /*!< 0x000C0000 */
#define SYSCFG_PA_IORP_PA9_IORP                   SYSCFG_PA_IORP_PA9_IORP_Msk                    
#define SYSCFG_PA_IORP_PA9_IORP_0                 (0x1UL << SYSCFG_PA_IORP_PA9_IORP_Pos)         /*!< 0x00040000 */ 
#define SYSCFG_PA_IORP_PA9_IORP_1                 (0x2UL << SYSCFG_PA_IORP_PA9_IORP_Pos)         /*!< 0x00080000 */ 

#define SYSCFG_PA_IORP_PA10_IORP_Pos              (20U)
#define SYSCFG_PA_IORP_PA10_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA10_IORP_Pos)        /*!< 0x00300000 */
#define SYSCFG_PA_IORP_PA10_IORP                  SYSCFG_PA_IORP_PA10_IORP_Msk                   
#define SYSCFG_PA_IORP_PA10_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA10_IORP_Pos)        /*!< 0x00100000 */ 
#define SYSCFG_PA_IORP_PA10_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA10_IORP_Pos)        /*!< 0x00200000 */ 

#define SYSCFG_PA_IORP_PA11_IORP_Pos              (22U)
#define SYSCFG_PA_IORP_PA11_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA11_IORP_Pos)        /*!< 0x00C00000 */
#define SYSCFG_PA_IORP_PA11_IORP                  SYSCFG_PA_IORP_PA11_IORP_Msk                   
#define SYSCFG_PA_IORP_PA11_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA11_IORP_Pos)        /*!< 0x00400000 */ 
#define SYSCFG_PA_IORP_PA11_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA11_IORP_Pos)        /*!< 0x00800000 */ 

#define SYSCFG_PA_IORP_PA12_IORP_Pos              (24U)
#define SYSCFG_PA_IORP_PA12_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA12_IORP_Pos)        /*!< 0x03000000 */
#define SYSCFG_PA_IORP_PA12_IORP                  SYSCFG_PA_IORP_PA12_IORP_Msk                   
#define SYSCFG_PA_IORP_PA12_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA12_IORP_Pos)        /*!< 0x01000000 */ 
#define SYSCFG_PA_IORP_PA12_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA12_IORP_Pos)        /*!< 0x02000000 */ 

#define SYSCFG_PA_IORP_PA13_IORP_Pos              (26U)
#define SYSCFG_PA_IORP_PA13_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA13_IORP_Pos)        /*!< 0x0C000000 */
#define SYSCFG_PA_IORP_PA13_IORP                  SYSCFG_PA_IORP_PA13_IORP_Msk                   
#define SYSCFG_PA_IORP_PA13_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA13_IORP_Pos)        /*!< 0x04000000 */ 
#define SYSCFG_PA_IORP_PA13_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA13_IORP_Pos)        /*!< 0x08000000 */ 

#define SYSCFG_PA_IORP_PA14_IORP_Pos              (28U)
#define SYSCFG_PA_IORP_PA14_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA14_IORP_Pos)        /*!< 0x30000000 */
#define SYSCFG_PA_IORP_PA14_IORP                  SYSCFG_PA_IORP_PA14_IORP_Msk                   
#define SYSCFG_PA_IORP_PA14_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA14_IORP_Pos)        /*!< 0x10000000 */ 
#define SYSCFG_PA_IORP_PA14_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA14_IORP_Pos)        /*!< 0x20000000 */ 

#define SYSCFG_PA_IORP_PA15_IORP_Pos              (30U)
#define SYSCFG_PA_IORP_PA15_IORP_Msk              (0x3UL << SYSCFG_PA_IORP_PA15_IORP_Pos)        /*!< 0xC0000000 */
#define SYSCFG_PA_IORP_PA15_IORP                  SYSCFG_PA_IORP_PA15_IORP_Msk                   
#define SYSCFG_PA_IORP_PA15_IORP_0                (0x1UL << SYSCFG_PA_IORP_PA15_IORP_Pos)        /*!< 0x40000000 */ 
#define SYSCFG_PA_IORP_PA15_IORP_1                (0x2UL << SYSCFG_PA_IORP_PA15_IORP_Pos)        /*!< 0x80000000 */ 

/*****************  Bit definition for PB_IORP register  ************************/
#define SYSCFG_PB_IORP_PB0_IORP_Pos               (0U)
#define SYSCFG_PB_IORP_PB0_IORP_Msk               (0x3UL << SYSCFG_PB_IORP_PB0_IORP_Pos)         /*!< 0x00000003 */
#define SYSCFG_PB_IORP_PB0_IORP                   SYSCFG_PB_IORP_PB0_IORP_Msk                    
#define SYSCFG_PB_IORP_PB0_IORP_0                 (0x1UL << SYSCFG_PB_IORP_PB0_IORP_Pos)         /*!< 0x00000001 */ 
#define SYSCFG_PB_IORP_PB0_IORP_1                 (0x2UL << SYSCFG_PB_IORP_PB0_IORP_Pos)         /*!< 0x00000002 */ 

#define SYSCFG_PB_IORP_PB1_IORP_Pos               (2U)
#define SYSCFG_PB_IORP_PB1_IORP_Msk               (0x3UL << SYSCFG_PB_IORP_PB1_IORP_Pos)         /*!< 0x0000000C */
#define SYSCFG_PB_IORP_PB1_IORP                   SYSCFG_PB_IORP_PB1_IORP_Msk                    
#define SYSCFG_PB_IORP_PB1_IORP_0                 (0x1UL << SYSCFG_PB_IORP_PB1_IORP_Pos)         /*!< 0x00000004 */ 
#define SYSCFG_PB_IORP_PB1_IORP_1                 (0x2UL << SYSCFG_PB_IORP_PB1_IORP_Pos)         /*!< 0x00000008 */ 

