OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx6.h
#define TK_CR2_CMODDISCH_Pos                (4U)
#define TK_CR2_CMODDISCH_Msk                (0x1UL << TK_CR2_CMODDISCH_Pos)  /*!< 0x00000010 */
#define TK_CR2_CMODDISCH                    TK_CR2_CMODDISCH_Msk                 

#define TK_CR2_MIDACEN_Pos                  (5U)
#define TK_CR2_MIDACEN_Msk                  (0x1UL << TK_CR2_MIDACEN_Pos)    /*!< 0x00000020 */
#define TK_CR2_MIDACEN                      TK_CR2_MIDACEN_Msk                   

#define TK_CR2_SIDACEN_Pos                  (6U)
#define TK_CR2_SIDACEN_Msk                  (0x1UL << TK_CR2_SIDACEN_Pos)    /*!< 0x00000040 */
#define TK_CR2_SIDACEN                      TK_CR2_SIDACEN_Msk                   

#define TK_CR2_CMODVTINIT_Pos               (7U)
#define TK_CR2_CMODVTINIT_Msk               (0x1UL << TK_CR2_CMODVTINIT_Pos)  /*!< 0x00000080 */
#define TK_CR2_CMODVTINIT                   TK_CR2_CMODVTINIT_Msk             

#define TK_CR2_PWMM_Pos                     (8U)
#define TK_CR2_PWMM_Msk                     (0x1UL << TK_CR2_PWMM_Pos)           /*!< 0x00000100 */
#define TK_CR2_PWMM                         TK_CR2_PWMM_Msk                      

#define TK_CR2_CTRLSOURCE_Pos               (9U)
#define TK_CR2_CTRLSOURCE_Msk               (0x1UL << TK_CR2_CTRLSOURCE_Pos)     /*!< 0x00000200 */
#define TK_CR2_CTRLSOURCE                   TK_CR2_CTRLSOURCE_Msk                

#define TK_CR2_LPABNORMAL_Pos               (10U)
#define TK_CR2_LPABNORMAL_Msk               (0x1UL << TK_CR2_LPABNORMAL_Pos)     /*!< 0x00000400 */
#define TK_CR2_LPABNORMAL                   TK_CR2_LPABNORMAL_Msk     

#define TK_CR2_CSA_DISCH_SEL_Pos            (11U)
#define TK_CR2_CSA_DISCH_SEL_Msk            (0x1UL << TK_CR2_CSA_DISCH_SEL_Pos)  /*!< 0x00000800 */
#define TK_CR2_CSA_DISCH_SEL                TK_CR2_CSA_DISCH_SEL_Msk     

#define TK_CR2_SHORTSW_NUM_Pos              (12U)
#define TK_CR2_SHORTSW_NUM_Msk              (0x3UL << TK_CR2_SHORTSW_NUM_Pos)    /*!< 0x00003000 */
#define TK_CR2_SHORTSW_NUM                  TK_CR2_SHORTSW_NUM_Msk                     
#define TK_CR2_SHORTSW_NUM_0                (0x1UL << TK_CR2_SHORTSW_NUM_Pos)    /*!< 0x00001000 */
#define TK_CR2_SHORTSW_NUM_1                (0x2UL << TK_CR2_SHORTSW_NUM_Pos)    /*!< 0x00002000 */

#define TK_CR2_LPEN_Pos                     (14U)
#define TK_CR2_LPEN_Msk                     (0x1UL << TK_CR2_LPEN_Pos)            /*!< 0x00004000 */
#define TK_CR2_LPEN                         TK_CR2_LPEN_Msk     

#define TK_CR2_KVREF_Pos                    (16U)
#define TK_CR2_KVREF_Msk                    (0x3UL << TK_CR2_KVREF_Pos)          /*!< 0x00030000 */
#define TK_CR2_KVREF                        TK_CR2_KVREF_Msk                     
#define TK_CR2_KVREF_0                      (0x1UL << TK_CR2_KVREF_Pos)          /*!< 0x00010000 */
#define TK_CR2_KVREF_1                      (0x2UL << TK_CR2_KVREF_Pos)          /*!< 0x00020000 */

#define TK_CR2_KVREF_CSA_TARGET_Pos         (18U)
#define TK_CR2_KVREF_CSA_TARGET_Msk         (0x3UL << TK_CR2_KVREF_CSA_TARGET_Pos)        /*!< 0x000C0000 */
#define TK_CR2_KVREF_CSA_TARGET             TK_CR2_KVREF_CSA_TARGET_Msk                   
#define TK_CR2_KVREF_CSA_TARGET_0           (0x1UL << TK_CR2_KVREF_CSA_TARGET_Pos)        /*!< 0x00040000 */
#define TK_CR2_KVREF_CSA_TARGET_1           (0x2UL << TK_CR2_KVREF_CSA_TARGET_Pos)        /*!< 0x00080000 */

#define TK_CR2_LFSRW_Pos                    (20U)
#define TK_CR2_LFSRW_Msk                    (0xFUL << TK_CR2_LFSRW_Pos)          /*!< 0x00F00000 */
#define TK_CR2_LFSRW                        TK_CR2_LFSRW_Msk                     
#define TK_CR2_LFSRW_0                      (0x1UL << TK_CR2_LFSRW_Pos)          /*!< 0x00100000 */
#define TK_CR2_LFSRW_1                      (0x2UL << TK_CR2_LFSRW_Pos)          /*!< 0x00200000 */
#define TK_CR2_LFSRW_2                      (0x4UL << TK_CR2_LFSRW_Pos)          /*!< 0x00400000 */
#define TK_CR2_LFSRW_3                      (0x8UL << TK_CR2_LFSRW_Pos)          /*!< 0x00800000 */

/*******************  Bit definition for TK_IDACR register  ********************/
#define TK_IDACR_MIDAC_Pos                  (0U)
#define TK_IDACR_MIDAC_Msk                  (0xFFUL << TK_IDACR_MIDAC_Pos)                /*!< 0x000000FF */
#define TK_IDACR_MIDAC                      TK_IDACR_MIDAC_Msk                   
#define TK_IDACR_MIDAC_0                    (0x1UL << TK_IDACR_MIDAC_Pos)                 /*!< 0x00000001 */
#define TK_IDACR_MIDAC_1                    (0x2UL << TK_IDACR_MIDAC_Pos)                 /*!< 0x00000002 */
#define TK_IDACR_MIDAC_2                    (0x4UL << TK_IDACR_MIDAC_Pos)                 /*!< 0x00000004 */
#define TK_IDACR_MIDAC_3                    (0x8UL << TK_IDACR_MIDAC_Pos)                 /*!< 0x00000008 */
#define TK_IDACR_MIDAC_4                    (0x10UL << TK_IDACR_MIDAC_Pos)                /*!< 0x00000010 */
#define TK_IDACR_MIDAC_5                    (0x20UL << TK_IDACR_MIDAC_Pos)                /*!< 0x00000020 */
#define TK_IDACR_MIDAC_6                    (0x40UL << TK_IDACR_MIDAC_Pos)                /*!< 0x00000040 */
#define TK_IDACR_MIDAC_7                    (0x80UL << TK_IDACR_MIDAC_Pos)                /*!< 0x00000080 */

#define TK_IDACR_SIDAC_Pos                  (16U)
#define TK_IDACR_SIDAC_Msk                  (0xFFUL << TK_IDACR_SIDAC_Pos)                /*!< 0x00FF0000 */
#define TK_IDACR_SIDAC                      TK_IDACR_SIDAC_Msk                   
#define TK_IDACR_SIDAC_0                    (0x1UL << TK_IDACR_SIDAC_Pos)                 /*!< 0x00010000 */
#define TK_IDACR_SIDAC_1                    (0x2UL << TK_IDACR_SIDAC_Pos)                 /*!< 0x00020000 */
#define TK_IDACR_SIDAC_2                    (0x4UL << TK_IDACR_SIDAC_Pos)                 /*!< 0x00040000 */
#define TK_IDACR_SIDAC_3                    (0x8UL << TK_IDACR_SIDAC_Pos)                 /*!< 0x00080000 */
#define TK_IDACR_SIDAC_4                    (0x10UL << TK_IDACR_SIDAC_Pos)                /*!< 0x00100000 */
#define TK_IDACR_SIDAC_5                    (0x20UL << TK_IDACR_SIDAC_Pos)                /*!< 0x00200000 */
#define TK_IDACR_SIDAC_6                    (0x40UL << TK_IDACR_SIDAC_Pos)                /*!< 0x00400000 */
#define TK_IDACR_SIDAC_7                    (0x80UL << TK_IDACR_SIDAC_Pos)                /*!< 0x00800000 */

#define TK_IDACR_SIDAC_CSA_TARGET_Pos       (24U)
#define TK_IDACR_SIDAC_CSA_TARGET_Msk       (0xFFUL << TK_IDACR_SIDAC_CSA_TARGET_Pos)     /*!< 0xFF000000 */
#define TK_IDACR_SIDAC_CSA_TARGET           TK_IDACR_SIDAC_CSA_TARGET_Msk                   
#define TK_IDACR_SIDAC_CSA_TARGET_0         (0x1UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)      /*!< 0x01000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_1         (0x2UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)      /*!< 0x02000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_2         (0x4UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)      /*!< 0x04000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_3         (0x8UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)      /*!< 0x08000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_4         (0x10UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)     /*!< 0x10000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_5         (0x20UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)     /*!< 0x20000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_6         (0x40UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)     /*!< 0x40000000 */
#define TK_IDACR_SIDAC_CSA_TARGET_7         (0x80UL << TK_IDACR_SIDAC_CSA_TARGET_Pos)     /*!< 0x80000000 */

/*******************  Bit definition for TK_KR register  ********************/
#define TK_KR_KEN_Pos                       (0U)
#define TK_KR_KEN_Msk                       (0x3FFFFFFUL << TK_KR_KEN_Pos)           /*!< 0x03FFFFFF */
#define TK_KR_KEN                           TK_KR_KEN_Msk         
#define TK_KR_KEN_0                         (0x1UL << TK_KR_KEN_Pos)           /*!< 0x00000001 */
#define TK_KR_KEN_1                         (0x2UL << TK_KR_KEN_Pos)           /*!< 0x00000002 */
#define TK_KR_KEN_2                         (0x4UL << TK_KR_KEN_Pos)           /*!< 0x00000004 */
#define TK_KR_KEN_3                         (0x8UL << TK_KR_KEN_Pos)           /*!< 0x00000008 */
#define TK_KR_KEN_4                         (0x10UL << TK_KR_KEN_Pos)          /*!< 0x00000010 */
#define TK_KR_KEN_5                         (0x20UL << TK_KR_KEN_Pos)          /*!< 0x00000020 */
#define TK_KR_KEN_6                         (0x40UL << TK_KR_KEN_Pos)          /*!< 0x00000040 */
#define TK_KR_KEN_7                         (0x80UL << TK_KR_KEN_Pos)          /*!< 0x00000080 */
#define TK_KR_KEN_8                         (0x100UL << TK_KR_KEN_Pos)         /*!< 0x00000100 */
#define TK_KR_KEN_9                         (0x200UL << TK_KR_KEN_Pos)         /*!< 0x00000200 */
#define TK_KR_KEN_10                        (0x400UL << TK_KR_KEN_Pos)         /*!< 0x00000400 */
#define TK_KR_KEN_11                        (0x800UL << TK_KR_KEN_Pos)         /*!< 0x00000800 */
#define TK_KR_KEN_12                        (0x1000UL << TK_KR_KEN_Pos)        /*!< 0x00001000 */
#define TK_KR_KEN_13                        (0x2000UL << TK_KR_KEN_Pos)        /*!< 0x00002000 */
#define TK_KR_KEN_14                        (0x4000UL << TK_KR_KEN_Pos)        /*!< 0x00004000 */
#define TK_KR_KEN_15                        (0x8000UL << TK_KR_KEN_Pos)        /*!< 0x00008000 */
#define TK_KR_KEN_16                        (0x10000UL << TK_KR_KEN_Pos)       /*!< 0x00010000 */
#define TK_KR_KEN_17                        (0x20000UL << TK_KR_KEN_Pos)       /*!< 0x00020000 */
#define TK_KR_KEN_18                        (0x40000UL << TK_KR_KEN_Pos)       /*!< 0x00040000 */
#define TK_KR_KEN_19                        (0x80000UL << TK_KR_KEN_Pos)       /*!< 0x00080000 */
#define TK_KR_KEN_20                        (0x100000UL << TK_KR_KEN_Pos)      /*!< 0x00100000 */
#define TK_KR_KEN_21                        (0x200000UL << TK_KR_KEN_Pos)      /*!< 0x00200000 */
#define TK_KR_KEN_22                        (0x400000UL << TK_KR_KEN_Pos)      /*!< 0x00400000 */
#define TK_KR_KEN_23                        (0x800000UL << TK_KR_KEN_Pos)      /*!< 0x00800000 */
#define TK_KR_KEN_24                        (0x1000000UL << TK_KR_KEN_Pos)     /*!< 0x01000000 */
#define TK_KR_KEN_25                        (0x2000000UL << TK_KR_KEN_Pos)     /*!< 0x02000000 */

/*******************  Bit definition for TK_CSR register  ********************/
#define TK_CSR_CHS_Pos                       (0U)
#define TK_CSR_CHS_Msk                       (0x3FFFFFFUL << TK_CSR_CHS_Pos)           /*!< 0x03FFFFFF */
#define TK_CSR_CHS                           TK_CSR_CHS_Msk         
#define TK_CSR_CHS_0                         (0x1UL << TK_CSR_CHS_Pos)           /*!< 0x00000001 */
#define TK_CSR_CHS_1                         (0x2UL << TK_CSR_CHS_Pos)           /*!< 0x00000002 */
#define TK_CSR_CHS_2                         (0x4UL << TK_CSR_CHS_Pos)           /*!< 0x00000004 */
#define TK_CSR_CHS_3                         (0x8UL << TK_CSR_CHS_Pos)           /*!< 0x00000008 */
#define TK_CSR_CHS_4                         (0x10UL << TK_CSR_CHS_Pos)          /*!< 0x00000010 */
#define TK_CSR_CHS_5                         (0x20UL << TK_CSR_CHS_Pos)          /*!< 0x00000020 */
#define TK_CSR_CHS_6                         (0x40UL << TK_CSR_CHS_Pos)          /*!< 0x00000040 */
#define TK_CSR_CHS_7                         (0x80UL << TK_CSR_CHS_Pos)          /*!< 0x00000080 */
#define TK_CSR_CHS_8                         (0x100UL << TK_CSR_CHS_Pos)         /*!< 0x00000100 */
#define TK_CSR_CHS_9                         (0x200UL << TK_CSR_CHS_Pos)         /*!< 0x00000200 */
#define TK_CSR_CHS_10                        (0x400UL << TK_CSR_CHS_Pos)         /*!< 0x00000400 */
#define TK_CSR_CHS_11                        (0x800UL << TK_CSR_CHS_Pos)         /*!< 0x00000800 */
#define TK_CSR_CHS_12                        (0x1000UL << TK_CSR_CHS_Pos)        /*!< 0x00001000 */
#define TK_CSR_CHS_13                        (0x2000UL << TK_CSR_CHS_Pos)        /*!< 0x00002000 */
#define TK_CSR_CHS_14                        (0x4000UL << TK_CSR_CHS_Pos)        /*!< 0x00004000 */
#define TK_CSR_CHS_15                        (0x8000UL << TK_CSR_CHS_Pos)        /*!< 0x00008000 */
#define TK_CSR_CHS_16                        (0x10000UL << TK_CSR_CHS_Pos)       /*!< 0x00010000 */
#define TK_CSR_CHS_17                        (0x20000UL << TK_CSR_CHS_Pos)       /*!< 0x00020000 */
#define TK_CSR_CHS_18                        (0x40000UL << TK_CSR_CHS_Pos)       /*!< 0x00040000 */
#define TK_CSR_CHS_19                        (0x80000UL << TK_CSR_CHS_Pos)       /*!< 0x00080000 */
#define TK_CSR_CHS_20                        (0x100000UL << TK_CSR_CHS_Pos)      /*!< 0x00100000 */
#define TK_CSR_CHS_21                        (0x200000UL << TK_CSR_CHS_Pos)      /*!< 0x00200000 */
#define TK_CSR_CHS_22                        (0x400000UL << TK_CSR_CHS_Pos)      /*!< 0x00400000 */
#define TK_CSR_CHS_23                        (0x800000UL << TK_CSR_CHS_Pos)      /*!< 0x00800000 */
#define TK_CSR_CHS_24                        (0x1000000UL << TK_CSR_CHS_Pos)     /*!< 0x01000000 */
#define TK_CSR_CHS_25                        (0x2000000UL << TK_CSR_CHS_Pos)     /*!< 0x02000000 */

/*******************  Bit definition for TK_UCR register  ********************/
#define TK_UCR_COPAMODEIO_Pos                       (0U)
#define TK_UCR_COPAMODEIO_Msk                       (0x3FFFFFFUL << TK_UCR_COPAMODEIO_Pos)           /*!< 0x03FFFFFF */
#define TK_UCR_COPAMODEIO                           TK_UCR_COPAMODEIO_Msk         
#define TK_UCR_COPAMODEIO_0                         (0x1UL << TK_UCR_COPAMODEIO_Pos)           /*!< 0x00000001 */
#define TK_UCR_COPAMODEIO_1                         (0x2UL << TK_UCR_COPAMODEIO_Pos)           /*!< 0x00000002 */
#define TK_UCR_COPAMODEIO_2                         (0x4UL << TK_UCR_COPAMODEIO_Pos)           /*!< 0x00000004 */
#define TK_UCR_COPAMODEIO_3                         (0x8UL << TK_UCR_COPAMODEIO_Pos)           /*!< 0x00000008 */
#define TK_UCR_COPAMODEIO_4                         (0x10UL << TK_UCR_COPAMODEIO_Pos)          /*!< 0x00000010 */
#define TK_UCR_COPAMODEIO_5                         (0x20UL << TK_UCR_COPAMODEIO_Pos)          /*!< 0x00000020 */
#define TK_UCR_COPAMODEIO_6                         (0x40UL << TK_UCR_COPAMODEIO_Pos)          /*!< 0x00000040 */
#define TK_UCR_COPAMODEIO_7                         (0x80UL << TK_UCR_COPAMODEIO_Pos)          /*!< 0x00000080 */
#define TK_UCR_COPAMODEIO_8                         (0x100UL << TK_UCR_COPAMODEIO_Pos)         /*!< 0x00000100 */
#define TK_UCR_COPAMODEIO_9                         (0x200UL << TK_UCR_COPAMODEIO_Pos)         /*!< 0x00000200 */
#define TK_UCR_COPAMODEIO_10                        (0x400UL << TK_UCR_COPAMODEIO_Pos)         /*!< 0x00000400 */
#define TK_UCR_COPAMODEIO_11                        (0x800UL << TK_UCR_COPAMODEIO_Pos)         /*!< 0x00000800 */
#define TK_UCR_COPAMODEIO_12                        (0x1000UL << TK_UCR_COPAMODEIO_Pos)        /*!< 0x00001000 */
#define TK_UCR_COPAMODEIO_13                        (0x2000UL << TK_UCR_COPAMODEIO_Pos)        /*!< 0x00002000 */
#define TK_UCR_COPAMODEIO_14                        (0x4000UL << TK_UCR_COPAMODEIO_Pos)        /*!< 0x00004000 */
#define TK_UCR_COPAMODEIO_15                        (0x8000UL << TK_UCR_COPAMODEIO_Pos)        /*!< 0x00008000 */
#define TK_UCR_COPAMODEIO_16                        (0x10000UL << TK_UCR_COPAMODEIO_Pos)       /*!< 0x00010000 */
#define TK_UCR_COPAMODEIO_17                        (0x20000UL << TK_UCR_COPAMODEIO_Pos)       /*!< 0x00020000 */
#define TK_UCR_COPAMODEIO_18                        (0x40000UL << TK_UCR_COPAMODEIO_Pos)       /*!< 0x00040000 */
#define TK_UCR_COPAMODEIO_19                        (0x80000UL << TK_UCR_COPAMODEIO_Pos)       /*!< 0x00080000 */
#define TK_UCR_COPAMODEIO_20                        (0x100000UL << TK_UCR_COPAMODEIO_Pos)      /*!< 0x00100000 */
#define TK_UCR_COPAMODEIO_21                        (0x200000UL << TK_UCR_COPAMODEIO_Pos)      /*!< 0x00200000 */
#define TK_UCR_COPAMODEIO_22                        (0x400000UL << TK_UCR_COPAMODEIO_Pos)      /*!< 0x00400000 */
#define TK_UCR_COPAMODEIO_23                        (0x800000UL << TK_UCR_COPAMODEIO_Pos)      /*!< 0x00800000 */
#define TK_UCR_COPAMODEIO_24                        (0x1000000UL << TK_UCR_COPAMODEIO_Pos)     /*!< 0x01000000 */
#define TK_UCR_COPAMODEIO_25                        (0x2000000UL << TK_UCR_COPAMODEIO_Pos)     /*!< 0x02000000 */

/*******************  Bit definition for TK_STR1 register  ********************/
#define TK_STR1_SETTIME_Pos                 (0U)
#define TK_STR1_SETTIME_Msk                 (0x3FFUL << TK_STR1_SETTIME_Pos)        /*!< 0x000003FF */
#define TK_STR1_SETTIME                     TK_STR1_SETTIME_Msk     
#define TK_STR1_SETTIME_0                   (0x1UL << TK_STR1_SETTIME_Pos)          /*!< 0x00000001 */
#define TK_STR1_SETTIME_1                   (0x2UL << TK_STR1_SETTIME_Pos)          /*!< 0x00000002 */
#define TK_STR1_SETTIME_2                   (0x4UL << TK_STR1_SETTIME_Pos)          /*!< 0x00000004 */
#define TK_STR1_SETTIME_3                   (0x8UL << TK_STR1_SETTIME_Pos)          /*!< 0x00000008 */
#define TK_STR1_SETTIME_4                   (0x10UL << TK_STR1_SETTIME_Pos)         /*!< 0x00000010 */
#define TK_STR1_SETTIME_5                   (0x20UL << TK_STR1_SETTIME_Pos)         /*!< 0x00000020 */
#define TK_STR1_SETTIME_6                   (0x40UL << TK_STR1_SETTIME_Pos)         /*!< 0x00000040 */
#define TK_STR1_SETTIME_7                   (0x80UL << TK_STR1_SETTIME_Pos)         /*!< 0x00000080 */
#define TK_STR1_SETTIME_8                   (0x100UL << TK_STR1_SETTIME_Pos)        /*!< 0x00000100 */
#define TK_STR1_SETTIME_9                   (0x200UL << TK_STR1_SETTIME_Pos)        /*!< 0x00000200 */

#define TK_STR1_VTINITTIME_Pos              (16U)
#define TK_STR1_VTINITTIME_Msk              (0xFFUL << TK_STR1_VTINITTIME_Pos)      /*!< 0x00FF0000 */
#define TK_STR1_VTINITTIME                  TK_STR1_VTINITTIME_Msk     
#define TK_STR1_VTINITTIME_0                (0x1UL << TK_STR1_VTINITTIME_Pos)       /*!< 0x00010000 */
#define TK_STR1_VTINITTIME_1                (0x2UL << TK_STR1_VTINITTIME_Pos)       /*!< 0x00020000 */
#define TK_STR1_VTINITTIME_2                (0x4UL << TK_STR1_VTINITTIME_Pos)       /*!< 0x00040000 */
#define TK_STR1_VTINITTIME_3                (0x8UL << TK_STR1_VTINITTIME_Pos)       /*!< 0x00080000 */
#define TK_STR1_VTINITTIME_4                (0x10UL << TK_STR1_VTINITTIME_Pos)      /*!< 0x00100000 */
#define TK_STR1_VTINITTIME_5                (0x20UL << TK_STR1_VTINITTIME_Pos)      /*!< 0x00200000 */
#define TK_STR1_VTINITTIME_6                (0x40UL << TK_STR1_VTINITTIME_Pos)      /*!< 0x00400000 */
#define TK_STR1_VTINITTIME_7                (0x80UL << TK_STR1_VTINITTIME_Pos)      /*!< 0x00800000 */

/*******************  Bit definition for TK_STR2 register  ********************/
#define TK_STR2_VREF_MIDAC_TIME_Pos         (0U)
#define TK_STR2_VREF_MIDAC_TIME_Msk         (0x1FUL << TK_STR2_VREF_MIDAC_TIME_Pos) /*!< 0x0000001F */
#define TK_STR2_VREF_MIDAC_TIME             TK_STR2_VREF_MIDAC_TIME_Msk                      
#define TK_STR2_VREF_MIDAC_TIME_0           (0x1UL << TK_STR2_VREF_MIDAC_TIME_Pos)  /*!< 0x00000001 */
#define TK_STR2_VREF_MIDAC_TIME_1           (0x2UL << TK_STR2_VREF_MIDAC_TIME_Pos)  /*!< 0x00000002 */
#define TK_STR2_VREF_MIDAC_TIME_2           (0x4UL << TK_STR2_VREF_MIDAC_TIME_Pos)  /*!< 0x00000004 */
#define TK_STR2_VREF_MIDAC_TIME_3           (0x8UL << TK_STR2_VREF_MIDAC_TIME_Pos)  /*!< 0x00000008 */
#define TK_STR2_VREF_MIDAC_TIME_4           (0x10UL << TK_STR2_VREF_MIDAC_TIME_Pos) /*!< 0x00000010 */

#define TK_STR2_DISCH_CHRG_TIME_Pos         (8U)
#define TK_STR2_DISCH_CHRG_TIME_Msk         (0x7FUL << TK_STR2_DISCH_CHRG_TIME_Pos) /*!< 0x00007F00 */
#define TK_STR2_DISCH_CHRG_TIME             TK_STR2_DISCH_CHRG_TIME_Msk                     
#define TK_STR2_DISCH_CHRG_TIME_0           (0x1UL << TK_STR2_DISCH_CHRG_TIME_Pos)  /*!< 0x00000100 */
#define TK_STR2_DISCH_CHRG_TIME_1           (0x2UL << TK_STR2_DISCH_CHRG_TIME_Pos)  /*!< 0x00000200 */
#define TK_STR2_DISCH_CHRG_TIME_2           (0x4UL << TK_STR2_DISCH_CHRG_TIME_Pos)  /*!< 0x00000400 */
#define TK_STR2_DISCH_CHRG_TIME_3           (0x8UL << TK_STR2_DISCH_CHRG_TIME_Pos)  /*!< 0x00000800 */
#define TK_STR2_DISCH_CHRG_TIME_4           (0x10UL << TK_STR2_DISCH_CHRG_TIME_Pos) /*!< 0x00001000 */
#define TK_STR2_DISCH_CHRG_TIME_5           (0x20UL << TK_STR2_DISCH_CHRG_TIME_Pos) /*!< 0x00002000 */
#define TK_STR2_DISCH_CHRG_TIME_6           (0x40UL << TK_STR2_DISCH_CHRG_TIME_Pos) /*!< 0x00004000 */

