OpenPuya/PY32T020_Firmware/Drivers/CMSIS/Device/PY32T020/Include/py32t020bx6.h
/*******************  Bit definition for TK_CDR register  ********************/
#define TK_CDR_CDATA_Pos                    (0U)
#define TK_CDR_CDATA_Msk                    (0xFFFFUL << TK_CDR_CDATA_Pos)          /*!< 0x0000FFFF */
#define TK_CDR_CDATA                        TK_CDR_CDATA_Msk                        

/*******************  Bit definition for TK_LPDR register  ********************/
#define TK_LPDR_NORMALDELTA_Pos             (0U)
#define TK_LPDR_NORMALDELTA_Msk             (0x3FFUL << TK_LPDR_NORMALDELTA_Pos)    /*!< 0x000003FF */
#define TK_LPDR_NORMALDELTA                 TK_LPDR_NORMALDELTA_Msk                 

#define TK_LPDR_ABNORMALDELTA_Pos           (16U)
#define TK_LPDR_ABNORMALDELTA_Msk           (0x3FFUL << TK_LPDR_ABNORMALDELTA_Pos)  /*!< 0x03FF0000 */
#define TK_LPDR_ABNORMALDELTA               TK_LPDR_ABNORMALDELTA_Msk               

/*******************  Bit definition for TK_LPTR register  ********************/
#define TK_LPTR_LPWAIT_Pos                  (0U)
#define TK_LPTR_LPWAIT_Msk                  (0x7FUL << TK_LPTR_LPWAIT_Pos)          /*!< 0x0000007F */
#define TK_LPTR_LPWAIT                      TK_LPTR_LPWAIT_Msk                      

/*******************  Bit definition for TK_OPR register  ********************/
#define TK_OPR_OP_Pos                       (0U)
#define TK_OPR_OP_Msk                       (0x3FUL << TK_OPR_OP_Pos)               /*!< 0x0000003F */
#define TK_OPR_OP                           TK_OPR_OP_Msk                   

/******************************************************************************/
/*                                                                            */
/*      Universal Synchronous Asynchronous Receiver Transmitter (UART)       */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for UART_DR register  *******************/
#define UART_DR_DR_Pos                     (0U)
#define UART_DR_DR_Msk                     (0x1FFUL << UART_DR_DR_Pos)           /*!< 0x000001FF */
#define UART_DR_DR                         UART_DR_DR_Msk                        /*!< Data value */
#define UART_DR_DR_0                       (0x1UL<<UART_DR_DR_Pos)               /*!< 0x00000001 */
#define UART_DR_DR_1                       (0x2UL<<UART_DR_DR_Pos)               /*!< 0x00000002 */
#define UART_DR_DR_2                       (0x4UL<<UART_DR_DR_Pos)               /*!< 0x00000004 */
#define UART_DR_DR_3                       (0x8UL<<UART_DR_DR_Pos)               /*!< 0x00000008 */
#define UART_DR_DR_4                       (0x10UL<<UART_DR_DR_Pos)              /*!< 0x00000010 */
#define UART_DR_DR_5                       (0x20UL<<UART_DR_DR_Pos)              /*!< 0x00000020 */
#define UART_DR_DR_6                       (0x40UL<<UART_DR_DR_Pos)              /*!< 0x00000040 */
#define UART_DR_DR_7                       (0x80UL<<UART_DR_DR_Pos)              /*!< 0x00000080 */
#define UART_DR_DR_8                       (0x100UL<<UART_DR_DR_Pos)             /*!< 0x00000100 */

/******************  Bit definition for UART_BRR register  *******************/
#define UART_BRR_BRR_Pos                   (0U)
#define UART_BRR_BRR_Msk                   (0xFFFFUL << UART_BRR_BRR_Pos)        /*!< 0x0000FFFF */
#define UART_BRR_BRR                       UART_BRR_BRR_Msk                      /*!< UART BRR */
#define UART_BRR_BRR_0                     (0x1UL<<UART_BRR_BRR_Pos)             /*!< 0x00000001 */
#define UART_BRR_BRR_1                     (0x2UL<<UART_BRR_BRR_Pos)             /*!< 0x00000002 */
#define UART_BRR_BRR_2                     (0x4UL<<UART_BRR_BRR_Pos)             /*!< 0x00000004 */
#define UART_BRR_BRR_3                     (0x8UL<<UART_BRR_BRR_Pos)             /*!< 0x00000008 */
#define UART_BRR_BRR_4                     (0x10UL<<UART_BRR_BRR_Pos)            /*!< 0x00000010 */
#define UART_BRR_BRR_5                     (0x20UL<<UART_BRR_BRR_Pos)            /*!< 0x00000020 */
#define UART_BRR_BRR_6                     (0x40UL<<UART_BRR_BRR_Pos)            /*!< 0x00000040 */
#define UART_BRR_BRR_7                     (0x80UL<<UART_BRR_BRR_Pos)            /*!< 0x00000080 */
#define UART_BRR_BRR_8                     (0x100UL<<UART_BRR_BRR_Pos)           /*!< 0x00000100 */
#define UART_BRR_BRR_9                     (0x200UL<<UART_BRR_BRR_Pos)           /*!< 0x00000200 */
#define UART_BRR_BRR_10                    (0x400UL<<UART_BRR_BRR_Pos)           /*!< 0x00000400 */
#define UART_BRR_BRR_11                    (0x800UL<<UART_BRR_BRR_Pos)           /*!< 0x00000800 */
#define UART_BRR_BRR_12                    (0x1000UL<<UART_BRR_BRR_Pos)          /*!< 0x00001000 */
#define UART_BRR_BRR_13                    (0x2000UL<<UART_BRR_BRR_Pos)          /*!< 0x00002000 */
#define UART_BRR_BRR_14                    (0x4000UL<<UART_BRR_BRR_Pos)          /*!< 0x00004000 */
#define UART_BRR_BRR_15                    (0x8000UL<<UART_BRR_BRR_Pos)          /*!< 0x00008000 */

/*******************  Bit definition for UART_SR register  *******************/
#define UART_SR_RXNE_Pos                   (0U)
#define UART_SR_RXNE_Msk                   (0x1UL << UART_SR_RXNE_Pos)           /*!< 0x00000001 */
#define UART_SR_RXNE                       UART_SR_RXNE_Msk                      /*!< Read Data Register Not Empty */

#define UART_SR_ORE_Pos                    (1U)
#define UART_SR_ORE_Msk                    (0x1UL << UART_SR_ORE_Pos)            /*!< 0x00000002 */
#define UART_SR_ORE                        UART_SR_ORE_Msk                       /*!< OverRun Error */

#define UART_SR_PE_Pos                     (2U)
#define UART_SR_PE_Msk                     (0x1UL << UART_SR_PE_Pos)             /*!< 0x00000004 */
#define UART_SR_PE                         UART_SR_PE_Msk                        /*!< Parity Error */

#define UART_SR_FE_Pos                     (3U)
#define UART_SR_FE_Msk                     (0x1UL << UART_SR_FE_Pos)             /*!< 0x00000008 */
#define UART_SR_FE                         UART_SR_FE_Msk                        /*!< Framing Error */

